WELCOME_MESSAGE = "Тебе очень повезло! Всего за 3 урока я пошагово передам тебе свою авторскую стратегию торговли, которую ты с лёгкостью освоишь уже сегодня. Мой метод работает в 70% случаев и его протестировали уже более 300 человек. Они отмечают, что раньше не могли найти точку входа в сделку, но после просмотра этих трёх роликов, они научились грамотно открывать позиции. Ты готов забрать мою стратегию? Жми на кнопку ЗАБРАТЬ ⬇️"
REMIDNER = "Ты решил сдаться, ещё не начав? Не надо так. Смотри курс, пока он ещё доступен. "
REMIDNER2 = "Скоро закрою доступ, а ты так и не посмотрел курс\n"
"Не сдавайся на ровном месте. Переходи по кнопке ниже, пока урок не пропал ⤵️"
LESSONS = {
    "lesson_1": {
        "text": "{name}, первый урок уже доступен, скорее открывай его и смотри до конца. В уроке я разобрал: \n"
"   - Какой 1 инструмент нужно знать, чтобы твоя торговая стратегия начала работать. \n"
"   - Почему 95% трейдеров ошибаются в торговле. \n"
"   - Как быть прибыльным на дистанции и жить за счёт рынка. \n"
"Чем раньше посмотришь урок, тем быстрее перестанешь ошибаться в выборе направления цены, жми кнопку ниже ⤵️",
        "url": "https://example.com/lesson1",
        "photo": "https://ibb.org.ru/1/qNlolp",
        "reminders": [
            "Все уже смотрят второй урок, присоединяйся! Готов поспорить, большинство ошибок ты совершаешь именно по тем причинам, о которых я говорю во втором уроке. Удели всего 5 минут и твоя торговля изменится.",
            "Спойлер, о котором узнаешь только ты и только потому, что решил сдаться слишком рано У тебя есть возможность получить консультацию от топового трейдера из моей команды. Ты сможешь задать любые вопросы по рынку, но только если полностью пройдешь мини курс. Действуй, второго шанса не будет"
        ],
        "next": "lesson_2"
    },
    "lesson_2": {
        "text": "{name}, представь, что ты научился предсказывать будущее…\n"
"   - И теперь каждая твоя сделка отрабатывает в плюс. \n"
"   - Ты больше не сидишь часами у графиков. \n"
"   - Ты находишь идеальную точку входа и выхода. \n"
"   - Цена идёт всегда в ту сторону, в которую захочешь. \n"
"…но, увы, предсказаниями мы здесь не занимаемся. Для заработка на рынке не нужно гадать, нужно работать с имеющимися фактами на графике. "
"И тебе для этого нужны всего 3 шага. "
"Какие? Смотри второй урок, там все ответы ⤵️ ",
        "url": "https://example.com/lesson2",
        "photo": "",
        "reminders": [
            "У тебя есть возможность получить консультацию от трейдера, смотри второй урок! Кнопка \"СМОТРЕТЬ\"",
        ],
        "next": "lesson_3"
    },
    
    "lesson_3": {
        "text": "{name}, молодец, ты на верном пути!\n"
"В третьем уроке я объясню тебе последний шаг, который позволяет находить идеальную точку входа в сделке. \n"
"И знаешь, среди 300 человек, которые применили мою стратегию, все отметили важность понимания именно третьего шага. \n"
"Уверен, у тебя всё получится. Я готов провести тебя за руку до результата. \n"
"Посмотри третье видео и не забудь забрать подарок. \n",
        "url": "https://example.com/lesson3",
        "photo": "https://ibb.org.ru/1/qNXqf0",
        "reminders": [
            "Привет, ты тут? Это Саша\n"
            "Решил лично написать, чтобы напомнить про третий урок.\n"
            "Знаю, у тебя были вопросы про точку входа и открытые позиции. Посмотри видео, найдешь все ответы. Если что, пиши с вопросами, я на связи.\n"
        ],
        "next": "final"
    },
    
    "final" : {
        "text": "{name}, поздравляю с прохождением мини-курса! Ты молодец 🤝🏽\n"
"Теперь у тебя есть понимание основ моей стратегии. \n"
"И я тебе дарю уникальный 🎁 подарок: \n"
"Карту с пошаговым планом входа в сделку, которую ты видел в мини курсе. Ранее ее стоимость была 100$, сейчас ты можешь забрать ее бесплатно. \n"
"Также, только в следующие 48 часов у тебя будет возможность записаться на консультацию с топовым трейдером из моей команды. \n"
"На консультации ты сможешь задать любые вопросы и разобрать свою торговую систему (если она есть). \n"
"Раньше эту консультацию мы проводили за 500$, но для учеников с мини курса мы решили сделать исключение. \n"
"Чтобы забрать карту и записаться на консультацию, напиши своему куратору @ слово «хочу» и он вышлет тебе всю информацию. \n"
"Аккаунт твоего куратора -> @\n"
"Мы будем рады поделиться с тобой пользой.",
        "photo": "https://ibb.org.ru/1/qNXNzK"
    }
}
